[
  {
    "title": "DoT Research Grants for NGNLab to Establish '6G Ubiquitous Connectivity Lab and Cutting-Edge Research'",
    "about": "The Department of Telecommunications, India, has sanctioned a three-year research grant for NGNLab to establish the '6G Ubiquitous Connectivity Lab: Advancing India's Health and Agriculture through Innovative Technologies.'",
    "images": [
      "./assets/img/dot_logo.png"
    ],
    "year": 2024
  },
  {
    "title": "NGNLab paper, in collaboration with Samsung R&D India, has been selected for presentation at the IEEE GLOBECOM 2024 conference in Cape Town, South Africa.",
    "about": "The paper  'OBSDNN: Optimal Beam Selection employing Deep Neural Networks in 6G Environment',  co-authored by Gunasekaran Raja, Madhan Raj Kanagarahinam, Deepak Suresh Rajendran, Sree Vinay Ravuru and Sidhaarthan Mamalaivasan has been selected for presentation in the 2024 IEEE GLOBECOM Global Communications Conference Workshop,  December 8-12, 2024, in Cape Town, South Africa.",
    "images": [
      "./assets/img/GLOBECOM_11.png"
    ],
    "year": 2024
  },
  {
    "title": "NGNLab paper has been selected for presentation at the IEEE FNWF 2024 in Dubai, UAE.",
    "about": "The paper 'Advanced Cognitive System for Reliable Lane Switch Prediction in Autonomous Vehicles.' co-authored by Gunasekaran Raja, Shivani Suresh, Jeyadev Needhidevan, and Shajina Anand, has been selected for presentation in the 2024 IEEE FNWF Future Networks World Forum,  October 15-17, 2024, in Dubai, UAE.",
    "images": [
      "./assets/img/FNWF2024_11.png"
    ],
    "year": 2024
  },
  {
    "title": "<a href='https://ngnlabweb.github.io/AIDM-AS-2024/' style='color: black;'>NGNLab invites paper submissions to the workshop at the IEEE ICDM 2024 conference.</a>",
    "about": "Paper submissions are invited to the workshop on 'Advances in AI-Driven Data Mining for Autonomous Systems workshop (AIDM-AS 2024)' in conjunction with the '2024 IEEE International Conference on Data Mining (ICDM 2024)' which is to be held in Abu Dhabi, UAE, from December 9-12, 2024. <br> <strong>Last date to submit papers: September 10, 2024.</strong>",
    "images": [
      "./assets/img/AIDM-AS.jpeg"
    ],
    "year": 2024
  },
  {
    "title": "<a href='https://fnwf2024.ieee.org/' style='color: black;'>NGNLab invites paper submissions to the IEEE FNWF 2024 conference</a>",
    "about": "Paper submissions are invited to the IEEE FNWF 2024 conference. Paper submissions are invited to Track 4: 5G and Future Network Special Verticals at the IEEE Future Networks World Forum, held in Dubai, UAE, from October 15-17, 2024. <br> <strong>Last date to submit papers: July 31, 2024.</strong>",
    "images": [
      "./assets/img/FNWF2024_11.png"
    ],
    "year": 2024
  },
  {
    "title": "NGNLab papers were presented at the IEEE VTC 2024-Spring conference in Singapore",
    "about": "Papers \"PointGAN: A Catalyst for Enhanced Vulnerable Road User Detection in Autonomous Navigation\" co-authored by Gunasekaran Raja, Hosam Alhakami, Sahaya Beni Prathiba, Jeyadev Needhidevan, Priyadarshni Vasudevan, Rupali Subramanian, Kapal Dev and \"Next-Gen Security: Enhanced DDoS Attack Detection for Autonomous Vehicles in 6G Networks\" co-authored by Sudha Anbalagan, Wajdi Alhakami, Mugundh Jambukeswaran Bhooma, Vijai Suria Marimuthu, Kapal Dev, Gunasekaran Raja were presented in IEEE: VTC 2024-Spring 99th Vehicular Technology Conference, June 24-27, 2024, in Singapore.",
    "images": [
      "./assets/img/VTC1.jpeg",
      "./assets/img/VTC.png",
      "./assets/img/VTC2.jpeg",
      "./assets/img/VTC3.jpeg",
      "./assets/img/VTC4.jpeg"    
    ],
    "year": 2024
  },
  {
    "title": "NGNLab paper was presented at the IEEE ICC 2024 conference in Denver, USA",
    "about": "Paper 'Adaptive Model Predictive Control-Driven Approach for Visual Detection of Micro-UAVs' co-authored by Gunasekaran Raja, Selvam Essaky, Deepak Suresh Rajendran, Sai Ganesh Senthivel, Sebastian Knorr, Kapal Dev, was presented in 2024 IEEE ICC International Conference on Communications, June 9-13, 2024, in Denver, USA.",
    "images": [
       "./assets/img/Denver4.jpeg",
      "./assets/img/icc.jpeg",
      "./assets/img/Denver1.jpeg",
      "./assets/img/Denver2.jpeg",
     "./assets/img/Denver3.jpeg"     
    ],
    "year": 2024
  },
  {
    "title": "NGNLab Alumnus Vishal Ravichandran Admitted into a Master's Program at University of Illinois Urbana-Champaign",
    "about": "Vishal Ravichandran, a current alumnus of NGNLab, was accepted into the Masters in Computer Science program at the University of Illinois Urbana-Champaign for the Fall 2024 term.  Illinois is consistently ranked among the top 5 universities in the United States for computer science-related programs, making this a significant accomplishment for Vishal.",
    "images": [
      "./assets/img/people/VishalRavichandran.jpeg"
    ],
    "year": 2024
  },
  {
    "title": "Ph.D Scholar from Ernst-Abbe-Hochschule, Jena, Germany embarks on Research Internship at Anna University, Chennai",
    "about": "Herbert Potechius, a Ph.D. student from the University of Applied Sciences Jena in Germany, undertakes a research internship at Anna University, Chennai in March 2024, facilitated by the DST-DAAD's 'Project-Related Personal Exchange (PPP)' funding program. During his time at Anna University, Herbert will engage in research activities at the NGNLab, focusing on immersive imaging, virtual reality, and UAV communications.",
    "images": [
      "./assets/img/Herbert2.jpeg",
      "./assets/img/Herbert1.jpeg"
    ],
    "year": 2024
  },
  {
    "title": "NGNLab and Department of Computer Technology Present: Two-Day Transnational Workshop on 'Smart Technologies for Societal Health'",
    "about": "On March 4th and 5th, 2024, the two-day Transnational Workshop on Smart Technologies for Societal Health convened experts from the UK, India, Malaysia, Vietnam, and Oman. Centered on AI, computer vision, robotics, and autonomous systems, it aimed to improve Societal Health in disaster-stricken regions. Featuring keynote lectures, panel discussions, and breakout sessions, participants addressed technical challenges and forged collaborative research plans.",
    "images": [
      "./assets/img/STSH4.jpeg",
      "./assets/img/STSH1.jpeg",
      "./assets/img/STSH2.jpeg",
      "./assets/img/STSH3.jpeg"
    ],
    "year": 2024
  },
  {
    "title": "NGNLab paper is accepted for presentation at the IEEE INFOCOM 2024 International Conference in Vancouver, Canada",
    "about": "Paper \"CPP-OTPO: A Cognitive Multi-UAV System for Adaptive Path and Trajectory Optimization\" co-authored by Gunasekaran Raja, Selvam Essaky, Surya Raj M, Jawaharlal Nehru N, Christ Joe, Kapal Dev, Waleed Ejaz, is to be presented in IEEE INFOCOM 2024 International Conference on Computer Communications-Workshop, 20-23 May 2024, in Vancouver, Canada.",
    "images": [
      "./assets/img/infocom.jpeg"
    ],
    "year": "2024"
  },
  {
    "title": "<a href='./assets/doc/Recruitment_Proj Associate _SERB_15.1.24.pdf' style='color: black;'>Project Associate Position in NGNLab under SERB project grant</a>",
    "about": "Under the SERB, DST-Government of India project grant, applications are invited for a Project Associate position in the NGNLab, Dept. of Computer Technology, Anna University, Chennai.<br> <strong>Last Date of Application: 15.01.2024.</strong>",
    "images": [
      "./assets/img/Serb.png"
    ],
    "year": "2024"
  },
  {
    "title": "NGNLab papers were presented at the IEEE GLOBECOM 2023 conference in Kuala Lumpur, Malaysia",
    "about": "Papers \"AI-empowered UAV Trajectory Optimization in 6G Aerial Networks\" and  \"TVUB: Thermal Vision-based UAV and Blockchain-aided Poaching Prevention System,\" co-authored by  Sai Ganesh, Sivaganesh B, Vishal Ravichandran, Saroja S, and Abhishek Manoharan, were presented in IEEE GLOBECOM 2023 conference, December 4-8, 2023, in Kuala Lumpur, Malaysia.",
    "images": [
      "./assets/img/klconf.png"
    ],
    "year": "2023"
  },
  {
    "title": "NGNLab Principal Investigator recognized as one of the World’s Top 2% Scientists for 2022",
    "about": "NGNLab Principal Investigator is recognized as one of the World’s Top 2% Scientists for 2022 by Stanford University, USA, in the field of Information and Communication Technology.",
    "images": [
      "./assets/img/Top2.png"
    ],
    "year": "2023"
  },
  {
    "title": "NGNLab, Ph.D. student attends Research Internship at Ernst-Abbe-Hochschule Jena, Germany",
    "about": "Selvam Essaky, a Ph.D. student from NGNLab, attends a research internship at Ernst-Abbe-Hochshule Jena, Germany (September 2023 to October 2023) under the DAAD program. The program allowed him to collaborate with researchers from Ernst-Abbe-Hochshule Jena, Germany, share knowledge, and leverage each other's expertise.  This program allowed Selvam to broaden his research horizons and investigate new areas of interest.",
    "images": [
      "./assets/img/germany.png"
    ],
    "year": "2023"
  },
  {
    "title": "NGNLab Alumnus Sai Ganesh Senthivel Admitted into a Master's Program at CMU",
    "about": "Sai Ganesh Senthivel, a current alumnus of NGNLab, was accepted into the Masters in Information Technology - Information Security program at the esteemed Carnegie Mellon University (CMU) for the Fall 2022 term. CMU is consistently ranked among the top 5 universities in the United States for computer science-related programs, making this a significant accomplishment for Sai.",
    "images": [
      "./assets/img/Sai-CMU.png"
    ],
    "year": "2023"
  },
  {
    "title": "NGNLab Ph.D. Student Attends Exchange Programme at Trinity College Dublin",
    "about": "Selvam Essaky, a PhD student from NGNLab,  attended an exchange program at Trinity College Dublin in Ireland (October 2022 to April 2023). The program allowed him to collaborate with researchers from Trinity College Dublin, share knowledge, and leverage each other's expertise. While Selvam was at Trinity College Dublin, he participated in diverse academic pursuits and attended workshops related to his field of study. The exchange program allowed Selvam to broaden his research horizons and investigate new areas of interest.",
    "images": [
      "./assets/img/TCD.jpg"
    ],
    "year": "2023"
  },
  {
    "title": "NGNs Admitted into Master's Programs at US Universities",
    "about": "Abhishek and Srividya have been accepted into graduate programs at two prestigious universities in the United States for the Fall 2023 term. Abhishek has been accepted into the University of Southern California (USC), while Srividya has been accepted into the University of Maryland, College Park (UMCP). USC and UMCP are renowned for their high-quality education and immense research opportunities. Their acceptance reflects their hard work, dedication, and research potential.",
    "images": [
      "./assets/img/arizonna.png"
    ],
    "year": "2023"
  },
  {
    "title": "NGNs Secure High-Paying Jobs with Top Companies",
    "about": "NGNs have secured placements in leading companies with lucrative compensation packages for June 2023. Thilaksurya was hired by Wells Fargo, while Balakumar was recruited by Tekion Corp. During the campus placement season, businesses from different industries, such as IT, manufacturing, and consulting, displayed a strong interest in hiring NGNLab students. The lab attributes the successful placements of its students to its strong academic programs, industry partnerships, and well-established alumni network.",
    "images": [
      "./assets/img/placements.png"
    ],
    "year": "2023"
  },
  {
    "title": "NGNs bag First prize at Prayatna 22' National level hackathon",
    "about": "Students from NGNLab, have been declared the champions of the Prayatna National level hackathon. The winning team comprising Deepak Suresh, Sree Vinay, and Sidhaarthan VM secured the top position in the event organized by AUSEC-MIT and ACT, Anna University.",
    "images": [
      "./assets/img/prayatna.jpeg"
    ],
    "year": "2023"
  },
  {
    "title": "NGNs Participate in a Six-Month Work-Based Learning Internship at ERNET India",
    "about": "Four final-year undergraduates from NGNlab, namely Srividya, Nishanthini, Sakthi, and Jagadeesh, have completed a six-month Work-Based Learning Research Internship at Education and Research Network (ERNET), IITM Research Park in Chennai, India. During the internship (November 2022 to April 2023), the students gained valuable insights into Time Sensitive Networking and its implementation on Linux. They also worked on various individual projects covering domains like Blockchain, Natural Language Processing, and Data Analytics. The internship at ERNET India provided the students with an opportunity to apply their theoretical knowledge in a practical setting, preparing them for a successful career ahead.",
    "images": [
      "./assets/img/ernet.png"
    ],
    "year": "2023"
  }
]
