{
    "newsRoom":
    [
        {
            "img": "./assets/img/Sai-CMU.png",
            "title": "NGNLab Alumnus Sai Ganesh Senthivel Receives an Admit to a Masters Program at CMU",
            "about": "Sai Ganesh Senthivel, a current alumnus of NGNLab, was accepted into the Masters in Information Technology - Information Security program at the esteemed Carnegie Mellon University (CMU) for the Fall 2022 term. CMU is consistently ranked among the top 5 universities in the United States for computer science-related programs, making this a significant accomplishment for Sai."
        },
        {
            "img": "./assets/img/trinityclgdublin.jpeg",
            "title": "NGNLab Ph.D. Student Attends Exchange Programme at Trinity College Dublin",
            "about": "Selvam Essaky, a PhD student from NGNLab, recently attended an exchange program at Trinity College Dublin in Ireland. The program provided him an opportunity to collaborate with researchers from Trinity College Dublin, share knowledge, and leverage each other's expertise. While Selvam was at Trinity College Dublin, he took part in diverse academic pursuits and attended workshops related to his field of study. The exchange program allowed Selvam to broaden his research horizons and investigate new areas of interest."
        },
        {
            "img": "./assets/img/arizonna.png",
            "title": "NGNLab UG Students Receive Admits into Master's Programs at US Universities",
            "about": "Abhishek and Srividya have been accepted into graduate programs at two prestigious universities in the United States. Abhishek has been accepted into the University of Southern California (USC), while Srividya has been accepted into the University of Maryland, College Park (UMCP). USC and UMCP are renowned for their high-quality education and immense research opportunities. Their acceptance reflects their hard work, dedication, and research potential."
        },
        {
            "img": "./assets/img/placements.png",
            "title": "NGN Students Secure High-Paying Jobs with Top Companies",
            "about": "NGNLab's undergraduate students have secured placements in leading companies with lucrative compensation packages. Thilaksurya was hired by Wells Fargo, while Balakumar was recruited by Tekion Corp. During the campus placement season, businesses from different industries, such as IT, manufacturing, and consulting, displayed a strong interest in hiring NGNLab students. The lab attributes the successful placements of its students to its strong academic programs, industry partnerships, and well-established alumni network."
        },
        {
            "img": "./assets/img/prayatna.jpeg",
            "title": "UG students bag First prize at Prayatna 22’ National level hackathon",
            "about": "Students from NGN lab, Anna University have been declared the champions of the Prayatna National level hackathon. The winning team comprising Deepak Suresh, Sree Vinay, and Sidhaarthan VM secured the top position in the event organized by AUSEC-MIT and ACT, Anna University."
        },
        {
            "img": "./assets/img/ernet.png",
            "title": "Final Year Members of NGNLab Participate in a Six-Month Work-Based Learning Internship at ERNET India",
            "about": "Four final-year undergraduates from NGNlab, namely Srividya, Nishanthini, Sakthi, and Jagadeesh, have successfully completed a six-month Work-Based Learning Research Internship at Education and Research Network (ERNET), IITM Research Park in Chennai, India. During the internship, the students gained valuable insights into Time Sensitive Networking and its implementation on Linux. They also worked on various individual projects covering domains like Blockchain, Natural Language Processing, and Data Analytics. The internship at ERNET India provided the students with an opportunity to apply their theoretical knowledge in a practical setting, preparing them for a successful career ahead."
        }
    ]
}